"""
Центральный конфигурационный файл проекта "IMDb Explorer".

Этот модуль служит как "Единый Источник Истины" (Single Source of Truth)
для всех ключевых параметров, таких как пути к файлам и имена таблиц.
Такой подход позволяет легко изменять конфигурацию в одном месте,
не затрагивая основной код приложения.
"""

# --- Пути к данным ---
# Исходный CSV-файл с данными, загруженный с Kaggle.
CSV_PATH = "imdb_top_1000.csv"
# Путь к файлу базы данных SQLite, которая будет создана оркестратором.
DB_PATH = "imdb.db"
# Путь к SQL-скрипту для выполнения сложного аналитического запроса.
SQL_TOP_DIRECTORS_PATH = "find_top_directors.sql"


# --- Параметры базы данных ---
# Название основной таблицы в базе данных SQLite.
TABLE_NAME = "imdb_data"
